{
    "name": "Liron Toledo",
    "headerTaglineOne": "Hello 👋",
    "headerTaglineTwo": "I'm Liron Toledo",
    "headerTaglineThree": "Software Engineer",
    "headerTaglineFour": "London, UK",
    "showCursor": false,
    "showBlog": false,
    "darkMode": true,
    "showResume": true,
    "socials": [
      { "id": "1", "title": "Github", "link": "https://github.com/Liron-Toledo" },
      {
        "id": "2",
        "title": "LinkedIn",
        "link": "https://www.linkedin.com/in/liron-toledo/"
      }
    ],
    "projects": [
      {
        "id": "1",
        "title": "CoDeepNEAT",
        "description": "Implementation and improvement of an existing evolutionary learning algorithm known as CoDeepNEAT. Our improvements proved successful in increasing the algorithm's speed and accuracy and were published in the IEEE Journal in 2020.",
        "imageSrc": "https://lh3.googleusercontent.com/drive-viewer/AKGpihZ4zkTH7uUhAf7W-SCl3cTd-LUzGo36ZvTvEhTKDxcsZYnY5W6NtlACkk2rxIshDmBcqA2kFhlYP2Ci5QxBvdCRUFZ9=s1600",
        "url": "https://github.com/sash-a/CoDeepNEAT"
      },
      {
        "id": "2",
        "title": "Bullet Sponge",
        "description": "Collaborated with small team in the implementation of a game created using Unity for GMTK23. One of the largest Game Jams competitions in the world. We built this game in just 48 hours. It can be described as a reverse bullet hell where you must be shot as much as possible!",
        "imageSrc": "https://lh3.googleusercontent.com/drive-viewer/AKGpihZpnK8jlbFG9CLxFljDdUTVSC0gDiryG-oluNTS5jYtKVmYEDq6UTWO-kCn7cF0ZfnnnEcBUYR0K6HkKXe1p4H2gnab=s2560",
        "url": "https://smashaza.itch.io/bullet-sponge"
      },
      {
        "id": "3",
        "title": "B.R.B",
        "description": "Collaborated in an entry for Ludum Dare 51. A small team and I built this video game in just 48 hours and came 210th out of 2414 entries. You play as a robot on an invaded ship, but you need to recharge every 10 seconds. Kill enemies to survive, but watch out the ship never forgets.",
        "imageSrc": "https://lh3.googleusercontent.com/drive-viewer/AKGpihbPhOPqEYYuzhDL48lubi_kWybL8PN35e1DvJzavE8WndVnV8vBet44_qB15-uETjzeGX-GcmmXRFk5_HOUH7yWqxWRDQ=s1600",
        "url": "https://smashaza.itch.io/ghost-loop"
      },
      {
        "id": "4",
        "title": "Serpus",
        "description": "Participated in a local game jam held in South Africa. Collaborated with small team to create this game in 48 hours. Discover the right weapons needed to kill the boss!",
        "imageSrc": "https://lh3.googleusercontent.com/drive-viewer/AKGpihY4ve5nqjQOXn7MYKZrtZSSeqbqDUHS7Xoc-MP231qlBN_l5qk3PAo15ZsFn6qZhJ2pc1xZCUWkyT6AAvUNbme8h03M=s2560",
        "url": "https://smashaza.itch.io/serpus"
      },
      {
        "id": "5",
        "title": "Secret Sauce",
        "description": "Collaborated with a small team on an entry to GMTK21. This game was completed in 48 hours. You are the secret sauce! Grow your horde to win and remember not to get found!",
        "imageSrc": "https://lh3.googleusercontent.com/drive-viewer/AKGpihYSFFihpRr3SV3hnNU0L3pJj_QvzDHu81XsyRCv3aJqynA7SgiGkKrN1UFD_yc6NgChQEJohc2v0h60hXet9usgFnd_8w=s2560",
        "url": "https://smashaza.itch.io/secret-sauce"
      },
      {
        "id": "6",
        "title": "Orb",
        "description": "Fully networked assymetric shooter made in unity. The game takes place on the inside of a sphere which you can fully traverse and if the opportunity presents itself shoot enemies directly above your head. The environment is also fully destructible, with the abilitiy to dig into caves to mine money or find portals to special weapons. The two classes have different abilities, the gunners have multiple weapons and grenades some of which need to be purchased and the wizards have a shield, a shock attack and can levitate voxels from the destructible ground and shoot it at enemies.",
        "imageSrc": "https://lh3.googleusercontent.com/drive-viewer/AKGpihYKqL_A40qXYRKqUfPVmJhjXfoZZNMBbaiTnOgau1bFqPACcNgQW4I-sdW2OBJOI-CeDwl65xpOT3tvdoFAUJ52YEO-=s1600",
        "url": "https://projects.cs.uct.ac.za/gamesproj/cgi-bin/view/2018/abramowitz_acton_toledo.zip/OrbWebsite/"
      }
    ],
    "services": [
      {
        "id": "1",
        "title": "Front-End Development",
        "description": "As a front-end developer, I have a deep proficiency in JavaScript, TypeScript, HTML, React, and CSS, which enables me to create dynamic, user-friendly interfaces. My role in developing and managing sophisticated 3D applications and software projects has honed my skills, allowing me to deliver engaging and immersive digital experiences through meticulous attention to detail and a keen eye for design."
      },
      {
        "id": "2",
        "title": "Back-End Development",
        "description": "In the realm of back-end development, I leverage technologies such as SQL, MySQL, Firebase, AWS and NodeJS to build robust, scalable systems. My experience ranges from enhancing backend infrastructures for 3D applications to streamlining data analysis processes, ensuring that I can integrate complex databases and server logic seamlessly with front-end components for efficient and reliable application performance."
      },
      {
        "id": "3",
        "title": "3D Software Development",
        "description": "My expertise in 3D software development is marked by my use of advanced visualization libraries like Three.js, ArcGIS, and Leaflet, alongside game engines such as Unity and Unreal. I have contributed to projects from creating masterplan visualizers and digital twins for urban design to developing immersive metaverse experiences, pushing the boundaries of virtual environments and simulations with innovative 3D technology applications."
      },
      {
        "id": "4",
        "title": "Game Development",
        "description": "My passion for game development is fuelled by my proficiency with Unity and Unreal Engine, underpinned by a solid grounding in C#, C++, and other related technologies. My academic background in computer games development and hands-on experience with games created outside of work such as B.R.B and Bullet Sponge exemplify my ability to design complex game mechanics, 3D models, and animations, creating engaging, entertaining, and visually stunning game experiences."
      }
    ],
    "aboutpara": "My passion for programming began in my formative years and ever since has shaped my career and personal interests. I have a Bachelor of Science and an Honours in Computer Science from the University of Cape Town, with a focus on computer games development. I have also leveraged my skills to construct innovative applications in various domains, such as video games, 3D software, web, and AI. I have published a paper on applying evolutionary algorithms to automate deep neural network parameter optimization, and I often contribute to video game hackathons. I thrive on challenges that sharpen my skills and expand my knowledge, particularly in collaborative environments where I can contribute to solving complex problems. I am committed to continuous learning and actively explore new technologies and advance my expertise. Looking forward, I am eager to bring this blend of experience, innovation, and proven impact to any position I undertake.",
    "resume": {
      "tagline": "Software Engineer",
      "description": "A skilled software engineer with a passion for full-stack development, 3D software, and game development. My expertise encompasses a broad range of technologies, including JavaScript, React, NodeJS, Unity, etc enabling him to create innovative and impactful digital solutions.",
      "experiences": [
        {
          "id": "1",
          "dates": "May 2023 - Present",
          "type": "Full Time",
          "position": "Software Engineer @ Cross Works",
          "bullets": "Responsible for developing and managing a variety of 3D applications & software projects ranging from masterplan visualisers to detailed digital twins for clients inside the urban design industry, Front-end expertise: JavaScript; TypeScript; HTML; React; CSS, Back-end expertise: SQL; MySQL; Firebase; NodeJS, Specialized in 2D/3D visualisation libraries: Three.js; ArcGIS; Leaflet, Specialised in Game Engines: Unity; C#; Unreal; C++, Project Management: Jira; Figma; PowerPoint; Excel"
        },
        {
          "id": "d495c23b-4f65-479a-9b8a-cfbc1c089725",
          "dates": "Sep 2020 - May 2023",
          "type": "Full Time",
          "position": "3D Web Developer @ Ydangle Apps",
          "bullets": "Involved in developing a variety of 3D applications & software ranging from online meta-verse web applications to immersive virtual experiences for local and international clients, Front-end expertise: JavaScript; TypeScript; HTML; React; CSS, Back-end expertise: NodeJS; SQL; AWS; Firebase, Specialised in 2D/3D visualisation libraries: Three.js; Babylon, Specialised in Game Engines: Unity; C#, Performed data analysis: SQL; Cluvio."
        }
      ],
      "education": {
        "universityName": "University of Cape Town",
        "universityDate": "2016-2019",
        "universityPara": "Bachelor of Science with Honours in Computer Science & Computer Games Development. Graduated with 72% GPA. Published thesis on evolutionary computation, which lead to significant improvements in a popular evolutionary algorithm."
      },
      "languages": [
        "TypeScript",
        "JavaScript",
        "HTML",
        "CSS",
        "C#",
        "C++",
        "Python"
      ],
      "frameworks": ["React", "NodeJs", "Three.js", "Babylon.js", "WebGL"],
      "others": ["Unity Engine", "Unreal Engine", "AWS", "Figma", "Jira"]
    }
  }
  