{
  "name": "Liron Toledo",
  "headerTaglineOne": "Hello 👋",
  "headerTaglineTwo": "I'm Liron Toledo",
  "headerTaglineThree": "Software Engineer",
  "headerTaglineFour": "London, UK",
  "showCursor": false,
  "showBlog": false,
  "darkMode": true,
  "showResume": true,
  "socials": [
    { "id": "1", "title": "Github", "link": "https://github.com/Liron-Toledo" },
    {
      "id": "2",
      "title": "LinkedIn",
      "link": "https://www.linkedin.com/in/liron-toledo/"
    }
  ],
  "projects": [
    {
      "id": "1",
      "title": "CoDeepNEAT",
      "description": "Implementation and improvement of an existing evolutionary learning algorithm known as CoDeepNEAT. Our improvements proved successful in increasing the algorithm's speed and accuracy and were published in the IEEE Journal in 2020.",
      "imageSrc": "images/portfolio/evolutionary-computing.jpg",
      "url": "https://github.com/sash-a/CoDeepNEAT"
    },
    {
      "id": "2",
      "title": "Bullet Sponge",
      "description": "Participated in the GMTK2023 game jam with friends to create this game in 48 hours. It can be described as a reverse bullet hell where you must be shot as much as possible!",
      "imageSrc": "images/portfolio/bullet-sponge.jpg",
      "url": "https://smashaza.itch.io/bullet-sponge"
    },
    {
      "id": "3",
      "title": "B.R.B",
      "description": "Collaborated with some friends in an entry for Ludum Dare 51. A small team and I built this video game in 48 hours and came 210th out of 2414 entries. You play as a robot on an invaded ship, but you need to recharge every 10 seconds. Kill enemies to survive, but watch out the ship never forgets.",
      "imageSrc": "images/portfolio/brb.jpg",
      "url": "https://smashaza.itch.io/ghost-loop"
    },
    {
      "id": "4",
      "title": "Serpus",
      "description": "Participated in a local game jam held in South Africa. Collaborated with small group of friends to create this game in 48 hours. Discover the right weapons needed to kill the boss!",
      "imageSrc": "images/portfolio/serpus.jpg",
      "url": "https://smashaza.itch.io/serpus"
    },
    {
      "id": "5",
      "title": "Secret Sauce",
      "description": "Collaborated with a small team on an entry to GMTK21. This game was completed in 48 hours. You are the secret sauce! Grow your horde to win and remember not to get found!",
      "imageSrc": "images/portfolio/secret-sauce.jpg",
      "url": "https://smashaza.itch.io/secret-sauce"
    },
    {
      "id": "6",
      "title": "Orb",
      "description": "Locally networked assymetric shooter made in unity. The game takes place on the inside of a sphere which you can fully traverse and if the opportunity presents itself even attack enemies directly above your head. The environment fully destructible through use of voxels, with the abilitiy to dig into the earth to mine resources or special weapons. Only two classes were developed, gunners & wizards, both of which have unique play styles and abilities.",
      "imageSrc": "images/portfolio/orb.jpg",
      "url": "https://projects.cs.uct.ac.za/gamesproj/cgi-bin/view/2018/abramowitz_acton_toledo.zip/OrbWebsite/"
    }
  ],
  "services": [
    {
      "id": "1",
      "title": "Front-End Development",
      "description": "I have gained a deep proficiency in JavaScript, TypeScript, HTML, React, and CSS, which has enabled me to create dynamic, user-friendly interfaces. My role in developing and managing sophisticated software projects has honed my skills, allowing me to deliver engaging and immersive digital experiences through close attention to detail and a keen eye for design."
    },
    {
      "id": "2",
      "title": "Back-End Development",
      "description": "I can leverage technologies such as SQL, MySQL, Firebase, AWS and NodeJS to build robust, scalable systems. My experience ranges from enhancing backend infrastructures for online web applications to streamlining data analysis through database querying. I have been involved in integrating complex databases and server logic seamlessly with front-end components for efficient and reliable application performance."
    },
    {
      "id": "3",
      "title": "3D Software Development",
      "description": "My expertise in 3D software development is marked by my use of advanced visualization libraries such as Three.js, Babylon.js, ArcGIS, and Leaflet, alongside game engines such as Unity and Unreal. I have contributed to projects ranging from the creation of fully immersive digital twins in VR for urban design to online metaverse platforms. I am always looking to push the boundaries of virtual environments and simulations with innovative 3D technology applications."
    },
    {
      "id": "4",
      "title": "Game Development",
      "description": "My skills in game development are fuelled by a strong admiration for the field as well as a proficiency with game engines such as Unity and Unreal as well as a solid grounding in C#, C++, and other related technologies. My academic background in computer games development and hands-on experience with game creation should further highlight my ability to design complex game mechanics and create engaging & entertaining experiences."
    }
  ],
  "aboutpara": "My fascination for programming began in my formative years and ever since has shaped my career and personal interests. It lead me to earn a Bachelor of Science and an Honours in Computer Science from the University of Cape Town, with a focus on computer games development. Additionally, it drove me to involve myself in the construction of software applications in various domains, such as video games, 3D software, web, and AI. I have published a paper on applying evolutionary algorithms to automate deep neural network parameter optimization, and I often contribute to video game hackathons. I thrive on challenges that sharpen my skills and expand my knowledge, particularly in collaborative environments where I can contribute to solving complex problems. I am committed to continuous learning and actively explore new technologies and advance my expertise whenever i get the oppertunity to do so. Looking forward, I am eager to bring my blend of experience, drive, and proven impact to any position I undertake."
}
